wosayttn/M55M1BSP/_CUnit/gdma/DMA350/dma350_regdef.h
typedef struct {
    __IOM uint32_t NSEC_CHINTRSTATUS0;                 /*!< Address offset: 0x000, Non-Secure Channel Interrupt Status Register 0 */
    uint32_t       RESERVED0[1];                       /*!< Address offset: 0x4 - 0x4, Reserved */
    __IOM uint32_t NSEC_STATUS;                        /*!< Address offset: 0x008, Non-Secure Status Register */
    __IOM uint32_t NSEC_CTRL;                          /*!< Address offset: 0x00C, Non-Secure Control Register */
    uint32_t       RESERVED1[1];                       /*!< Address offset: 0x10 - 0x10, Reserved */
    __IOM uint32_t NSEC_CHPTR;                         /*!< Address offset: 0x014, Non-Secure Channel Pointer */
    __IOM uint32_t NSEC_CHCFG;                         /*!< Address offset: 0x018, Non-Secure Channel Configuration Register */
    uint32_t       RESERVED2[53];                      /*!< Address offset: 0x1C - 0xEC, Reserved */
    __IOM uint32_t NSEC_STATUSPTR;                     /*!< Address offset: 0x0F0, Non-Secure Unit Status Pointer Register */
    __IOM uint32_t NSEC_STATUSVAL;                     /*!< Address offset: 0x0F4, Non-Secure Unit Status Value Register */
    __IOM uint32_t NSEC_SIGNALPTR;                     /*!< Address offset: 0x0F8, Non-Secure Unit Signal Pointer */
    __IOM uint32_t NSEC_SIGNALVAL;                     /*!< Address offset: 0x0FC, Non-Secure Unit Signal Value Register */
} DMANSECCTRL_TypeDef;
typedef struct {
    __IOM uint32_t SEC_CHINTRSTATUS0;                  /*!< Address offset: 0x000, Secure Channel Interrupt Status Register 0 */
    uint32_t       RESERVED0[1];                       /*!< Address offset: 0x4 - 0x4, Reserved */
    __IOM uint32_t SEC_STATUS;                         /*!< Address offset: 0x008, Secure Status Register */
    __IOM uint32_t SEC_CTRL;                           /*!< Address offset: 0x00C, Secure Control Register */
    uint32_t       RESERVED1[1];                       /*!< Address offset: 0x10 - 0x10, Reserved */
    __IOM uint32_t SEC_CHPTR;                          /*!< Address offset: 0x014, Secure Channel Pointer */
    __IOM uint32_t SEC_CHCFG;                          /*!< Address offset: 0x018, Secure Channel Configuration Register */
    uint32_t       RESERVED2[53];                      /*!< Address offset: 0x1C - 0xEC, Reserved */
    __IOM uint32_t SEC_STATUSPTR;                      /*!< Address offset: 0x0F0, Secure Unit Status Pointer Register */
    __IOM uint32_t SEC_STATUSVAL;                      /*!< Address offset: 0x0F4, Secure Unit Status Value Register */
    __IOM uint32_t SEC_SIGNALPTR;                      /*!< Address offset: 0x0F8, Secure Unit Signal Pointer */
    __IOM uint32_t SEC_SIGNALVAL;                      /*!< Address offset: 0x0FC, Secure Unit Signal Value Register */
} DMASECCTRL_TypeDef;
typedef struct {
    __IOM uint32_t SCFG_CHSEC0;                        /*!< Address offset: 0x000, Secure Configuration Channel Security Mapping Register 0 */
    uint32_t       RESERVED0[1];                       /*!< Address offset: 0x4 - 0x4, Reserved */
    __IOM uint32_t SCFG_TRIGINSEC0;                    /*!< Address offset: 0x008, Secure Configuration Trigger Input Security Mapping Register 0 */
    uint32_t       RESERVED1[7];                       /*!< Address offset: 0xC - 0x24, Reserved */
    __IOM uint32_t SCFG_TRIGOUTSEC0;                   /*!< Address offset: 0x028, Secure Configuration Trigger Output Security Mapping Register 0 */
    uint32_t       RESERVED2[5];                       /*!< Address offset: 0x2C - 0x3C, Reserved */
    __IOM uint32_t SCFG_CTRL;                          /*!< Address offset: 0x040, Secure Configuration Control */
    __IOM uint32_t SCFG_INTRSTATUS;                    /*!< Address offset: 0x044, Secure Configuration Interrupt Status */
} DMASECCFG_TypeDef;
typedef struct {
    uint32_t       RESERVED0[44];                      /*!< Address offset: 0x0 - 0xAC, Reserved */
    __IOM uint32_t DMA_BUILDCFG0;                      /*!< Address offset: 0x0B0, DMA Build Configuration Register 0 */
    __IOM uint32_t DMA_BUILDCFG1;                      /*!< Address offset: 0x0B4, DMA Build Configuration Register 1 */
    __IOM uint32_t DMA_BUILDCFG2;                      /*!< Address offset: 0x0B8, DMA Build Configuration Register 2 */
    uint32_t       RESERVED1[3];                       /*!< Address offset: 0xBC - 0xC4, Reserved */
    __IOM uint32_t IIDR;                               /*!< Address offset: 0x0C8, Implementation Identification Register */
    __IOM uint32_t AIDR;                               /*!< Address offset: 0x0CC, Architecture Identification Register */
    __IOM uint32_t PIDR4;                              /*!< Address offset: 0x0D0, Peripheral ID4 Register */
    uint32_t       RESERVED2[3];                       /*!< Address offset: 0xD4 - 0xDC, Reserved */
    __IOM uint32_t PIDR0;                              /*!< Address offset: 0x0E0, Peripheral ID0 Register */
    __IOM uint32_t PIDR1;                              /*!< Address offset: 0x0E4, Peripheral ID1 Register */
    __IOM uint32_t PIDR2;                              /*!< Address offset: 0x0E8, Peripheral ID2 Register */
    __IOM uint32_t PIDR3;                              /*!< Address offset: 0x0EC, Peripheral ID 3 Register */
    __IOM uint32_t CIDR0;                              /*!< Address offset: 0x0F0, Component ID0 Register */
    __IOM uint32_t CIDR1;                              /*!< Address offset: 0x0F4, Component ID1 Register */
    __IOM uint32_t CIDR2;                              /*!< Address offset: 0x0F8, Component ID2 Register */
    __IOM uint32_t CIDR3;                              /*!< Address offset: 0x0FC, Component ID3 Register */
} DMAINFO_TypeDef;

/******************************************************************************/
/*                       Field Definitions of Registers                       */
/******************************************************************************/
/******************************************************************************/
/*                                   DMACH                                    */
/******************************************************************************/
/******************  Field definitions for CH_CMD register  *******************/
#define DMA_CH_CMD_ENABLECMD_Pos                    (0U)
#define DMA_CH_CMD_ENABLECMD_Msk                    (0x1UL << DMA_CH_CMD_ENABLECMD_Pos)                       /*!< 0x00000001UL*/
#define DMA_CH_CMD_ENABLECMD                        DMA_CH_CMD_ENABLECMD_Msk                                  /*!< ENABLECMD bit Channel Enable. When set to '1', enables the channel to run its programmed task. When set to '1', it cannot be set back to zero, and this field will automatically clear to zero when a DMA process is completed. To force the DMA to stop prematurely, you must use CH_CMD.STOPCMD instead.*/
#define DMA_CH_CMD_CLEARCMD_Pos                     (1U)
#define DMA_CH_CMD_CLEARCMD_Msk                     (0x1UL << DMA_CH_CMD_CLEARCMD_Pos)                        /*!< 0x00000002UL*/
#define DMA_CH_CMD_CLEARCMD                         DMA_CH_CMD_CLEARCMD_Msk                                   /*!< CLEARCMD bit DMA Clear command. When set to '1', it will remain high until all DMA channel registers and any internal queues and buffers are cleared, before returning to '0'. When set at the same time as ENABLECMD or while the DMA channel is already enabled, the clear will only occur after any ongoing DMA operation is either completed, stopped or disabled and the ENABLECMD bit is deasserted by the DMA.*/
#define DMA_CH_CMD_DISABLECMD_Pos                   (2U)
#define DMA_CH_CMD_DISABLECMD_Msk                   (0x1UL << DMA_CH_CMD_DISABLECMD_Pos)                      /*!< 0x00000004UL*/
#define DMA_CH_CMD_DISABLECMD                       DMA_CH_CMD_DISABLECMD_Msk                                 /*!< DISABLECMD bit Disable DMA Operation at the end of the current DMA command operation. Once set to '1', this field will stay high and the current DMA command will be allowed to complete, but the DMA will not fetch the next linked command or will it auto-restart the DMA command even if they are set. Once the DMA has stopped, it will return to '0' and ENABLECMD is also cleared. When set at the same time as ENABLECMD or when the channel is not enabled then write to this register is ignored.*/
#define DMA_CH_CMD_STOPCMD_Pos                      (3U)
#define DMA_CH_CMD_STOPCMD_Msk                      (0x1UL << DMA_CH_CMD_STOPCMD_Pos)                         /*!< 0x00000008UL*/
#define DMA_CH_CMD_STOPCMD                          DMA_CH_CMD_STOPCMD_Msk                                    /*!< STOPCMD bit Stop Current DMA Operation. Once set to '1', his will remain high until the DMA channel is stopped cleanly. Then this will return to '0' and ENABLECMD is also cleared. When set at the same time as ENABLECMD or when the channel is not enabled then write to this register is ignored. Note that each DMA channel can have other sources of a stop request and this field will not reflect the state of the other sources.*/
#define DMA_CH_CMD_PAUSECMD_Pos                     (4U)
#define DMA_CH_CMD_PAUSECMD_Msk                     (0x1UL << DMA_CH_CMD_PAUSECMD_Pos)                        /*!< 0x00000010UL*/
#define DMA_CH_CMD_PAUSECMD                         DMA_CH_CMD_PAUSECMD_Msk                                   /*!< PAUSECMD bit Pause Current DMA Operation. Once set to '1' the status cannot change until the DMA operation reached the paused state indicated by the STAT_PAUSED and STAT_RESUMEWAIT bits. The bit can be set by SW by writing it to '1', the current active DMA operation will be paused as soon as possible, but the ENABLECMD bit will remain HIGH to show that the operation is still active.  Cleared automatically when STAT_RESUMEWAIT is set and the RESUMECMD bit is written to '1', meaning that the SW continues the operation of the channel. Note that each DMA channel can have other sources of a pause request and this field will not reflect the state of the other sources. When set at the same time as ENABLECMD or when the channel is not enabled then write to this register is ignored.*/
#define DMA_CH_CMD_RESUMECMD_Pos                    (5U)
#define DMA_CH_CMD_RESUMECMD_Msk                    (0x1UL << DMA_CH_CMD_RESUMECMD_Pos)                       /*!< 0x00000020UL*/
#define DMA_CH_CMD_RESUMECMD                        DMA_CH_CMD_RESUMECMD_Msk                                  /*!< RESUMECMD bit Resume Current DMA Operation. Writing this bit to '1' means that the DMAC can continue the operation of a paused channel. Can be set to '1' when the PAUSECMD or a STAT_DONE assertion with DONEPAUSEEN set HIGH results in pausing the current DMA channel operation indicated by the STAT_PAUSED and STAT_RESUMEWAIT bits. Otherwise, writes to this bit are ignored.*/
#define DMA_CH_CMD_SRCSWTRIGINREQ_Pos               (16U)
#define DMA_CH_CMD_SRCSWTRIGINREQ_Msk               (0x1UL << DMA_CH_CMD_SRCSWTRIGINREQ_Pos)                  /*!< 0x00010000UL*/
#define DMA_CH_CMD_SRCSWTRIGINREQ                   DMA_CH_CMD_SRCSWTRIGINREQ_Msk                             /*!< SRCSWTRIGINREQ bit Software Generated Source Trigger Input Request. Write to '1' to create a SW trigger request to the DMA with the specified type in the SRCSWTRIGINTYPE register. Once set to '1', this will remain high until the DMA accepted the trigger and will return this to '0'. It will also be cleared automatically if the current command is completed without expecting another trigger event. When the channel is not enabled, write to this register is ignored.*/
#define DMA_CH_CMD_SRCSWTRIGINTYPE_Pos              (17U)
#define DMA_CH_CMD_SRCSWTRIGINTYPE_Msk              (0x3UL << DMA_CH_CMD_SRCSWTRIGINTYPE_Pos)                 /*!< 0x00060000UL*/
#define DMA_CH_CMD_SRCSWTRIGINTYPE                  DMA_CH_CMD_SRCSWTRIGINTYPE_Msk                            /*!< SRCSWTRIGINTYPE[ 1:0] bits Software Generated Source Trigger Input Request Type. Selects the trigger request type for the source trigger input when the SW triggers the SRCSWTRIGINREQ bit.
 - 00: Single request
 - 01: Last single request
 - 10: Block request
 - 11: Last block request
This field cannot be changed while the SRCSWTRIGINREQ bit is set.*/
#define DMA_CH_CMD_SRCSWTRIGINTYPE_0                (0x1UL << DMA_CH_CMD_SRCSWTRIGINTYPE_Pos)                 /*!< 0x00020000UL*/
#define DMA_CH_CMD_SRCSWTRIGINTYPE_1                (0x2UL << DMA_CH_CMD_SRCSWTRIGINTYPE_Pos)                 /*!< 0x00040000UL*/
#define DMA_CH_CMD_DESSWTRIGINREQ_Pos               (20U)
#define DMA_CH_CMD_DESSWTRIGINREQ_Msk               (0x1UL << DMA_CH_CMD_DESSWTRIGINREQ_Pos)                  /*!< 0x00100000UL*/
#define DMA_CH_CMD_DESSWTRIGINREQ                   DMA_CH_CMD_DESSWTRIGINREQ_Msk                             /*!< DESSWTRIGINREQ bit Software Generated Destination Trigger Input Request. Write to '1' to create a SW trigger request to the DMA with the specified type in the DESSWTRIGINTYPE register. Once set to '1', this will remain high until the DMA is accepted the trigger and will return this to '0'. It will also be cleared automatically if the current command is completed without expecting another trigger event. When the channel is not enabled, write to this register is ignored.*/
#define DMA_CH_CMD_DESSWTRIGINTYPE_Pos              (21U)
#define DMA_CH_CMD_DESSWTRIGINTYPE_Msk              (0x3UL << DMA_CH_CMD_DESSWTRIGINTYPE_Pos)                 /*!< 0x00600000UL*/
#define DMA_CH_CMD_DESSWTRIGINTYPE                  DMA_CH_CMD_DESSWTRIGINTYPE_Msk                            /*!< DESSWTRIGINTYPE[ 1:0] bits Software Generated Destination Trigger Input Request Type. Selects the trigger request type for the destination trigger input when the SW triggers the DESSWTRIGINREQ bit.
 - 00: Single request
 - 01: Last single request
 - 10: Block request
 - 11: Last block request
This field cannot be changed while the DESSWTRIGINREQ bit is set.*/
#define DMA_CH_CMD_DESSWTRIGINTYPE_0                (0x1UL << DMA_CH_CMD_DESSWTRIGINTYPE_Pos)                 /*!< 0x00200000UL*/
#define DMA_CH_CMD_DESSWTRIGINTYPE_1                (0x2UL << DMA_CH_CMD_DESSWTRIGINTYPE_Pos)                 /*!< 0x00400000UL*/
#define DMA_CH_CMD_SWTRIGOUTACK_Pos                 (24U)
#define DMA_CH_CMD_SWTRIGOUTACK_Msk                 (0x1UL << DMA_CH_CMD_SWTRIGOUTACK_Pos)                    /*!< 0x01000000UL*/
#define DMA_CH_CMD_SWTRIGOUTACK                     DMA_CH_CMD_SWTRIGOUTACK_Msk                               /*!< SWTRIGOUTACK bit Software Generated Trigger Output Acknowledge. Write '1' to acknowledge a Trigger Output request from the DMA. Once set to '1', this will remain high until the DMA Trigger Output is raised (either on the trigger output signal or as an interrupt) and the acknowledge is accepted. When the channel is not enabled, write to this register is ignored.*/
/*****************  Field definitions for CH_STATUS register  *****************/
#define DMA_CH_STATUS_INTR_DONE_Pos                 (0U)
#define DMA_CH_STATUS_INTR_DONE_Msk                 (0x1UL << DMA_CH_STATUS_INTR_DONE_Pos)                    /*!< 0x00000001UL*/
#define DMA_CH_STATUS_INTR_DONE                     DMA_CH_STATUS_INTR_DONE_Msk                               /*!< INTR_DONE bit Done Interrupt Flag. This interrupt will be set to HIGH if the INTREN_DONE is set and the STAT_DONE status flag gets raised. Automatically cleared when STAT_DONE is cleared.*/
#define DMA_CH_STATUS_INTR_ERR_Pos                  (1U)
#define DMA_CH_STATUS_INTR_ERR_Msk                  (0x1UL << DMA_CH_STATUS_INTR_ERR_Pos)                     /*!< 0x00000002UL*/
#define DMA_CH_STATUS_INTR_ERR                      DMA_CH_STATUS_INTR_ERR_Msk                                /*!< INTR_ERR bit Error Interrupt Flag. This interrupt will be set to HIGH if the INTREN_ERR is set and the STAT_ERR status flag gets raised. Automatically cleared when STAT_ERR is cleared.*/
#define DMA_CH_STATUS_INTR_DISABLED_Pos             (2U)
#define DMA_CH_STATUS_INTR_DISABLED_Msk             (0x1UL << DMA_CH_STATUS_INTR_DISABLED_Pos)                /*!< 0x00000004UL*/
#define DMA_CH_STATUS_INTR_DISABLED                 DMA_CH_STATUS_INTR_DISABLED_Msk                           /*!< INTR_DISABLED bit Disabled Interrupt Flag. This interrupt will be set to HIGH if the INTREN_DISABLED is set and the STAT_DISABLED flag gets raised. Automatically cleared when STAT_DISABLED is cleared.*/
#define DMA_CH_STATUS_INTR_STOPPED_Pos              (3U)
#define DMA_CH_STATUS_INTR_STOPPED_Msk              (0x1UL << DMA_CH_STATUS_INTR_STOPPED_Pos)                 /*!< 0x00000008UL*/
#define DMA_CH_STATUS_INTR_STOPPED                  DMA_CH_STATUS_INTR_STOPPED_Msk                            /*!< INTR_STOPPED bit Stopped Interrupt Flag. This interrupt will be set to HIGH if the INTREN_STOPPED is set and the STAT_STOPPED flag gets raised. Automatically cleared when STAT_STOPPED is cleared.*/
#define DMA_CH_STATUS_INTR_SRCTRIGINWAIT_Pos        (8U)
#define DMA_CH_STATUS_INTR_SRCTRIGINWAIT_Msk        (0x1UL << DMA_CH_STATUS_INTR_SRCTRIGINWAIT_Pos)           /*!< 0x00000100UL*/
#define DMA_CH_STATUS_INTR_SRCTRIGINWAIT            DMA_CH_STATUS_INTR_SRCTRIGINWAIT_Msk                      /*!< INTR_SRCTRIGINWAIT bit Channel is waiting for Source Trigger Interrupt Flag. This interrupt will be set to HIGH if the INTREN_SRCTRIGINWAIT is set and the STAT_SRCTRIGINWAIT status flag is asserted. Automatically cleared when STAT_SRCTRIGINWAIT is cleared.*/
#define DMA_CH_STATUS_INTR_DESTRIGINWAIT_Pos        (9U)
#define DMA_CH_STATUS_INTR_DESTRIGINWAIT_Msk        (0x1UL << DMA_CH_STATUS_INTR_DESTRIGINWAIT_Pos)           /*!< 0x00000200UL*/
#define DMA_CH_STATUS_INTR_DESTRIGINWAIT            DMA_CH_STATUS_INTR_DESTRIGINWAIT_Msk                      /*!< INTR_DESTRIGINWAIT bit Channel is waiting for Destination Trigger Interrupt Flag. This interrupt will be set to HIGH if the INTREN_DESTRIGINWAIT is set and the STAT_DESTRIGINWAIT status flag is asserted. Automatically cleared when STAT_DESTRIGINWAIT is cleared.*/
#define DMA_CH_STATUS_INTR_TRIGOUTACKWAIT_Pos       (10U)
#define DMA_CH_STATUS_INTR_TRIGOUTACKWAIT_Msk       (0x1UL << DMA_CH_STATUS_INTR_TRIGOUTACKWAIT_Pos)          /*!< 0x00000400UL*/
#define DMA_CH_STATUS_INTR_TRIGOUTACKWAIT           DMA_CH_STATUS_INTR_TRIGOUTACKWAIT_Msk                     /*!< INTR_TRIGOUTACKWAIT bit Channel is waiting for output Trigger Acknowledgement Interrupt Flag.  This interrupt will be set to HIGH if the INTREN_TRIGOUTACKWAIT is set and the STAT_TRIGOUTACKWAIT status flag is asserted. Automatically cleared when STAT_TRIGOUTACKWAIT is cleared.*/
#define DMA_CH_STATUS_STAT_DONE_Pos                 (16U)
#define DMA_CH_STATUS_STAT_DONE_Msk                 (0x1UL << DMA_CH_STATUS_STAT_DONE_Pos)                    /*!< 0x00010000UL*/
#define DMA_CH_STATUS_STAT_DONE                     DMA_CH_STATUS_STAT_DONE_Msk                               /*!< STAT_DONE bit Done Status Flag. This flag will be set to HIGH when the DMA command reaches the state defined by the DONETYPE settings. When DONEPAUSEEN is set the DMA command operation is paused when this flag is asserted. Write '1' to this bit to clear it. Automatically cleared when the ENABLECMD is set.*/
#define DMA_CH_STATUS_STAT_ERR_Pos                  (17U)
#define DMA_CH_STATUS_STAT_ERR_Msk                  (0x1UL << DMA_CH_STATUS_STAT_ERR_Pos)                     /*!< 0x00020000UL*/
#define DMA_CH_STATUS_STAT_ERR                      DMA_CH_STATUS_STAT_ERR_Msk                                /*!< STAT_ERR bit Error Status Flag. This flag will be set to HIGH if the DMA encounters an error during its operation. The details about the error event can be found in the ERRINFO register. Write '1' to this bit to clear it. When cleared, it also clears the ERRINFO register. Automatically cleared when the ENABLECMD is set.*/
#define DMA_CH_STATUS_STAT_DISABLED_Pos             (18U)
#define DMA_CH_STATUS_STAT_DISABLED_Msk             (0x1UL << DMA_CH_STATUS_STAT_DISABLED_Pos)                /*!< 0x00040000UL*/
#define DMA_CH_STATUS_STAT_DISABLED                 DMA_CH_STATUS_STAT_DISABLED_Msk                           /*!< STAT_DISABLED bit Disabled Status Flag. This flag will be set to HIGH if the DMA channel is successfully disabled using the DISABLECMD command. Write '1' to this bit to clear it. Automatically cleared when the ENABLECMD is set.*/
#define DMA_CH_STATUS_STAT_STOPPED_Pos              (19U)
#define DMA_CH_STATUS_STAT_STOPPED_Msk              (0x1UL << DMA_CH_STATUS_STAT_STOPPED_Pos)                 /*!< 0x00080000UL*/
#define DMA_CH_STATUS_STAT_STOPPED                  DMA_CH_STATUS_STAT_STOPPED_Msk                            /*!< STAT_STOPPED bit Stopped Status Flag. This flag will be set to HIGH if the DMA channel successfully reached the stopped state. The stop request can come from many internal or external sources. Write '1' to this bit to clear it. Automatically cleared when the ENABLECMD is set.*/
#define DMA_CH_STATUS_STAT_PAUSED_Pos               (20U)
#define DMA_CH_STATUS_STAT_PAUSED_Msk               (0x1UL << DMA_CH_STATUS_STAT_PAUSED_Pos)                  /*!< 0x00100000UL*/
#define DMA_CH_STATUS_STAT_PAUSED                   DMA_CH_STATUS_STAT_PAUSED_Msk                             /*!< STAT_PAUSED bit Paused Status Flag. This flag will be set to HIGH if the DMA channel successfully paused the operation of the command. The pause request can come from many internal or external sources. When the request to pause is not asserted anymore the bit will be cleared automatically and the command operation can continue.*/
#define DMA_CH_STATUS_STAT_RESUMEWAIT_Pos           (21U)
#define DMA_CH_STATUS_STAT_RESUMEWAIT_Msk           (0x1UL << DMA_CH_STATUS_STAT_RESUMEWAIT_Pos)              /*!< 0x00200000UL*/
#define DMA_CH_STATUS_STAT_RESUMEWAIT               DMA_CH_STATUS_STAT_RESUMEWAIT_Msk                         /*!< STAT_RESUMEWAIT bit Waiting for resume from software Flag. This flag indicates that the DMA channel successfully paused the operation of the command and needs SW acknowledgment to resume the operation. Will be set to HIGH if STAT_PAUSED is asserted and the PAUSECMD bit set in the command register or when the STAT_DONE is asserted and the DONEPAUSEEN bit is set. Cleared when the RESUMECMD bit is set in the command register.*/
#define DMA_CH_STATUS_STAT_SRCTRIGINWAIT_Pos        (24U)
#define DMA_CH_STATUS_STAT_SRCTRIGINWAIT_Msk        (0x1UL << DMA_CH_STATUS_STAT_SRCTRIGINWAIT_Pos)           /*!< 0x01000000UL*/
#define DMA_CH_STATUS_STAT_SRCTRIGINWAIT            DMA_CH_STATUS_STAT_SRCTRIGINWAIT_Msk                      /*!< STAT_SRCTRIGINWAIT bit Channel is waiting for Source Trigger Status. This bit is set to HIGH when DMA channel starts waiting for source input trigger request. Automatically cleared when the source trigger request is received either from HW or SW source. */
#define DMA_CH_STATUS_STAT_DESTRIGINWAIT_Pos        (25U)
#define DMA_CH_STATUS_STAT_DESTRIGINWAIT_Msk        (0x1UL << DMA_CH_STATUS_STAT_DESTRIGINWAIT_Pos)           /*!< 0x02000000UL*/
#define DMA_CH_STATUS_STAT_DESTRIGINWAIT            DMA_CH_STATUS_STAT_DESTRIGINWAIT_Msk                      /*!< STAT_DESTRIGINWAIT bit Channel is waiting for Destination Trigger Status. This bit is set to HIGH when DMA channel starts waiting for destination input trigger request. Automatically cleared when the destination trigger request is received either from HW or SW source.*/
#define DMA_CH_STATUS_STAT_TRIGOUTACKWAIT_Pos       (26U)
#define DMA_CH_STATUS_STAT_TRIGOUTACKWAIT_Msk       (0x1UL << DMA_CH_STATUS_STAT_TRIGOUTACKWAIT_Pos)          /*!< 0x04000000UL*/
