wosayttn/M55M1BSP/_CUnit/gdma/DMA350/dma350_regdef.h
#define DMA_CH_STATUS_STAT_TRIGOUTACKWAIT           DMA_CH_STATUS_STAT_TRIGOUTACKWAIT_Msk                     /*!< STAT_TRIGOUTACKWAIT bit Channel is waiting for output Trigger Acknowledgement Status. This bit is set to HIGH when DMA channel starts waiting for output trigger acknowledgement. Automatically cleared when the output trigger acknowledgement is received either from HW or SW source.*/
/*****************  Field definitions for CH_INTREN register  *****************/
#define DMA_CH_INTREN_INTREN_DONE_Pos               (0U)
#define DMA_CH_INTREN_INTREN_DONE_Msk               (0x1UL << DMA_CH_INTREN_INTREN_DONE_Pos)                  /*!< 0x00000001UL*/
#define DMA_CH_INTREN_INTREN_DONE                   DMA_CH_INTREN_INTREN_DONE_Msk                             /*!< INTREN_DONE bit Done Interrupt Enable. When set to HIGH, enables the INTR_DONE to be set and raise an interrupt when the STAT_DONE status flag is asserted. When set to LOW, it prevents INTR_DONE to be asserted. Currently pending interrupts are not affected by clearing this bit.*/
#define DMA_CH_INTREN_INTREN_ERR_Pos                (1U)
#define DMA_CH_INTREN_INTREN_ERR_Msk                (0x1UL << DMA_CH_INTREN_INTREN_ERR_Pos)                   /*!< 0x00000002UL*/
#define DMA_CH_INTREN_INTREN_ERR                    DMA_CH_INTREN_INTREN_ERR_Msk                              /*!< INTREN_ERR bit Error Interrupt Enable. When set to HIGH, enables INTR_ERROR to be set and raise an interrupt when the STAT_ERR status flag is asserted. When set to LOW, it prevents INTR_ERR to be asserted. Currently pending interrupts are not affected by clearing this bit.*/
#define DMA_CH_INTREN_INTREN_DISABLED_Pos           (2U)
#define DMA_CH_INTREN_INTREN_DISABLED_Msk           (0x1UL << DMA_CH_INTREN_INTREN_DISABLED_Pos)              /*!< 0x00000004UL*/
#define DMA_CH_INTREN_INTREN_DISABLED               DMA_CH_INTREN_INTREN_DISABLED_Msk                         /*!< INTREN_DISABLED bit Disabled Interrupt Enable. When set to HIGH, enables INTR_DISABLED to be set and raise an interrupt when STAT_DISABLED status flag is asserted. When set to LOW, it prevents INTR_DISABLED to be asserted. Currently pending interrupts are not affected by clearing this bit.*/
#define DMA_CH_INTREN_INTREN_STOPPED_Pos            (3U)
#define DMA_CH_INTREN_INTREN_STOPPED_Msk            (0x1UL << DMA_CH_INTREN_INTREN_STOPPED_Pos)               /*!< 0x00000008UL*/
#define DMA_CH_INTREN_INTREN_STOPPED                DMA_CH_INTREN_INTREN_STOPPED_Msk                          /*!< INTREN_STOPPED bit Stopped Interrupt Enable. When set to HIGH, enables INTR_STOPPED to be set and raise an interrupt when STAT_STOPPED status flag is asserted. When set to LOW, it prevents INTR_STOPPED to be asserted. Currently pending interrupts are not affected by clearing this bit.*/
#define DMA_CH_INTREN_INTREN_SRCTRIGINWAIT_Pos      (8U)
#define DMA_CH_INTREN_INTREN_SRCTRIGINWAIT_Msk      (0x1UL << DMA_CH_INTREN_INTREN_SRCTRIGINWAIT_Pos)         /*!< 0x00000100UL*/
#define DMA_CH_INTREN_INTREN_SRCTRIGINWAIT          DMA_CH_INTREN_INTREN_SRCTRIGINWAIT_Msk                    /*!< INTREN_SRCTRIGINWAIT bit Channel is waiting for Source Trigger Interrupt Enable. When set to HIGH, enables INTR_SRCTRIGINWAIT to be set and raise an interrupt when STAT_SRCTRIGINWAIT status flag is asserted. When set to LOW, it prevents INTR_SRCTRIGINWAIT to be asserted. Currently pending interrupts are not affected by clearing this bit.*/
#define DMA_CH_INTREN_INTREN_DESTRIGINWAIT_Pos      (9U)
#define DMA_CH_INTREN_INTREN_DESTRIGINWAIT_Msk      (0x1UL << DMA_CH_INTREN_INTREN_DESTRIGINWAIT_Pos)         /*!< 0x00000200UL*/
#define DMA_CH_INTREN_INTREN_DESTRIGINWAIT          DMA_CH_INTREN_INTREN_DESTRIGINWAIT_Msk                    /*!< INTREN_DESTRIGINWAIT bit Channel is waiting for destination Trigger Interrupt Enable. When set to HIGH, enables INTR_DESTRIGINWAIT to be set and raise an interrupt when STAT_DESTRIGINWAIT status flag is asserted. When set to LOW, it prevents INTR_DESTRIGINWAIT to be asserted. Currently pending interrupts are not affected by clearing this bit.*/
#define DMA_CH_INTREN_INTREN_TRIGOUTACKWAIT_Pos     (10U)
#define DMA_CH_INTREN_INTREN_TRIGOUTACKWAIT_Msk     (0x1UL << DMA_CH_INTREN_INTREN_TRIGOUTACKWAIT_Pos)        /*!< 0x00000400UL*/
#define DMA_CH_INTREN_INTREN_TRIGOUTACKWAIT         DMA_CH_INTREN_INTREN_TRIGOUTACKWAIT_Msk                   /*!< INTREN_TRIGOUTACKWAIT bit Channel is waiting for output Trigger Acknowledgement Interrupt Enable. When set to HIGH, enables INTR_TRIGOUTACKWAIT to be set and raise an interrupt when STAT_TRIGOUTACKWAIT status flag is asserted. When set to LOW, it prevents INTR_TRIGOUTACKWAIT to be asserted. Currently pending interrupts are not affected by clearing this bit.*/
/******************  Field definitions for CH_CTRL register  ******************/
#define DMA_CH_CTRL_TRANSIZE_Pos                    (0U)
#define DMA_CH_CTRL_TRANSIZE_Msk                    (0x7UL << DMA_CH_CTRL_TRANSIZE_Pos)                       /*!< 0x00000007UL*/
#define DMA_CH_CTRL_TRANSIZE                        DMA_CH_CTRL_TRANSIZE_Msk                                  /*!< TRANSIZE[ 2:0] bits Transfer Entity Size. Size in bytes = 2^TRANSIZE.
 - 000: Byte
 - 001: Halfworld
 - 010: Word
 - 011: Doubleword
 - 100: 128bits
 - 101: 256bits
 - 110: 512bits
 - 111: 1024bits
Note that DATA_WIDTH limits this field. Address will be aligned to TRANSIZE by the DMAC by ignoring the lower bits.*/
#define DMA_CH_CTRL_TRANSIZE_0                      (0x1UL << DMA_CH_CTRL_TRANSIZE_Pos)                       /*!< 0x00000001UL*/
#define DMA_CH_CTRL_TRANSIZE_1                      (0x2UL << DMA_CH_CTRL_TRANSIZE_Pos)                       /*!< 0x00000002UL*/
#define DMA_CH_CTRL_TRANSIZE_2                      (0x4UL << DMA_CH_CTRL_TRANSIZE_Pos)                       /*!< 0x00000004UL*/
#define DMA_CH_CTRL_CHPRIO_Pos                      (4U)
#define DMA_CH_CTRL_CHPRIO_Msk                      (0xFUL << DMA_CH_CTRL_CHPRIO_Pos)                         /*!< 0x000000F0UL*/
#define DMA_CH_CTRL_CHPRIO                          DMA_CH_CTRL_CHPRIO_Msk                                    /*!< CHPRIO[ 3:0] bits Channel Priority.
 - 0: Lowest Priority
 - 15: Highest Priority*/
#define DMA_CH_CTRL_CHPRIO_0                        (0x1UL << DMA_CH_CTRL_CHPRIO_Pos)                         /*!< 0x00000010UL*/
#define DMA_CH_CTRL_CHPRIO_1                        (0x2UL << DMA_CH_CTRL_CHPRIO_Pos)                         /*!< 0x00000020UL*/
#define DMA_CH_CTRL_CHPRIO_2                        (0x4UL << DMA_CH_CTRL_CHPRIO_Pos)                         /*!< 0x00000040UL*/
#define DMA_CH_CTRL_CHPRIO_3                        (0x8UL << DMA_CH_CTRL_CHPRIO_Pos)                         /*!< 0x00000080UL*/
#define DMA_CH_CTRL_XTYPE_Pos                       (9U)
#define DMA_CH_CTRL_XTYPE_Msk                       (0x7UL << DMA_CH_CTRL_XTYPE_Pos)                          /*!< 0x00000E00UL*/
#define DMA_CH_CTRL_XTYPE                           DMA_CH_CTRL_XTYPE_Msk                                     /*!< XTYPE[ 2:0] bits Operation type for X direction:
 - 000: "disable" - No data transfer will take place for this command. This mode can be used to create empty commands that wait for an event or set GPOs.
 - 001: "continue" - Copy data in a continuous manner from source to the destination. For 1D operations it is expected that SRCXSIZE is equal to DESXSIZE, other combinations result in UNPREDICTABLE behavior. For 2D operations, this mode can be used for simple 2D to 2D copy but it also allows the reshaping of the data like 1D to 2D or 2D to 1D conversions. If the DESXSIZE is smaller than SRCXSIZE then the read data from the current source line goes to the next destination line. If SRCXSIZE is smaller than DESXSIZE then the reads start on the next line and data is written to the remainder of the current destination line. Note: For 1D to 2D the SRCYSIZE for 2D to 1D conversion the DESYSIZE needs to be set to 1 when using this mode.
 - 010: "wrap" - Wrap source data within a destination line when the end of the source line is reached. Read starts again from the beginning of the source line and copied to the remainder of the destination line. If the DESXSIZE is smaller than SRCXSIZE then the behavior is UNPREDICTABLE. Not supported when HAS_WRAP is 0 in HW
 - 011: "fill" - Fill the remainder of the destination line with FILLVAL when the end of the source line is reached. If the DESXSIZE is smaller than SRCXSIZE then the behavior is UNPREDICTABLE. Not supported when HAS_WRAP is 0 in HW.
 - Others: Reserved.*/
#define DMA_CH_CTRL_XTYPE_0                         (0x1UL << DMA_CH_CTRL_XTYPE_Pos)                          /*!< 0x00000200UL*/
#define DMA_CH_CTRL_XTYPE_1                         (0x2UL << DMA_CH_CTRL_XTYPE_Pos)                          /*!< 0x00000400UL*/
#define DMA_CH_CTRL_XTYPE_2                         (0x4UL << DMA_CH_CTRL_XTYPE_Pos)                          /*!< 0x00000800UL*/
#define DMA_CH_CTRL_YTYPE_Pos                       (12U)
#define DMA_CH_CTRL_YTYPE_Msk                       (0x7UL << DMA_CH_CTRL_YTYPE_Pos)                          /*!< 0x00007000UL*/
#define DMA_CH_CTRL_YTYPE                           DMA_CH_CTRL_YTYPE_Msk                                     /*!< YTYPE[ 2:0] bits Operation type for Y direction:
 - 000: "disable" - Only do 1D transfers. When HAS_2D is 0, meaning 2D capability is not supported in HW, the YTYPE is always "000".
 - 001: "continue" - Copy 2D data in a continuous manner from source area to the destination area by using the YSIZE registers. The copy stops when the source runs out of data or the destination runs out of space. Not supported when HAS_2D is 0 in HW.
 - 010: "wrap" - Wrap the 2D source area within the destination 2D area by starting to copy data from the beginning of the first source line to the remaining space in the destination area. If the destination area is smaller than the source area then the behavior is UNPREDICTABLE. Not supported when HAS_WRAP or HAS_2D is 0 in HW.
 - 011:  Fill the remainder of the destination area with FILLVAL when the source area runs out of data. If the destination area is smaller than the source area then the behavior is UNPREDICTABLE. Not supported when HAS_WRAP or HAS_2D is 0 in HW
 - Others: Reserved*/
#define DMA_CH_CTRL_YTYPE_0                         (0x1UL << DMA_CH_CTRL_YTYPE_Pos)                          /*!< 0x00001000UL*/
#define DMA_CH_CTRL_YTYPE_1                         (0x2UL << DMA_CH_CTRL_YTYPE_Pos)                          /*!< 0x00002000UL*/
#define DMA_CH_CTRL_YTYPE_2                         (0x4UL << DMA_CH_CTRL_YTYPE_Pos)                          /*!< 0x00004000UL*/
#define DMA_CH_CTRL_REGRELOADTYPE_Pos               (18U)
#define DMA_CH_CTRL_REGRELOADTYPE_Msk               (0x7UL << DMA_CH_CTRL_REGRELOADTYPE_Pos)                  /*!< 0x001C0000UL*/
#define DMA_CH_CTRL_REGRELOADTYPE                   DMA_CH_CTRL_REGRELOADTYPE_Msk                             /*!< REGRELOADTYPE[ 2:0] bits Automatic register reload type. Defines how the DMA command reloads initial values at the end of a DMA command before autorestarting, ending or linking to a new DMA command:
 - 000: Reload Disabled.
 - 001: Reload source and destination size registers only.
 - 011: Reload source address only and all source and destination size registers.
 - 101: Reload destination address only and all source and destination size registers.
 - 111: Reload source and destination address and all source and destination size registers.
 - Others: Reserved.
NOTE: When CLEARCMD is set, the reloaded registers will also be cleared.*/
#define DMA_CH_CTRL_REGRELOADTYPE_0                 (0x1UL << DMA_CH_CTRL_REGRELOADTYPE_Pos)                  /*!< 0x00040000UL*/
#define DMA_CH_CTRL_REGRELOADTYPE_1                 (0x2UL << DMA_CH_CTRL_REGRELOADTYPE_Pos)                  /*!< 0x00080000UL*/
#define DMA_CH_CTRL_REGRELOADTYPE_2                 (0x4UL << DMA_CH_CTRL_REGRELOADTYPE_Pos)                  /*!< 0x00100000UL*/
#define DMA_CH_CTRL_DONETYPE_Pos                    (21U)
#define DMA_CH_CTRL_DONETYPE_Msk                    (0x7UL << DMA_CH_CTRL_DONETYPE_Pos)                       /*!< 0x00E00000UL*/
#define DMA_CH_CTRL_DONETYPE                        DMA_CH_CTRL_DONETYPE_Msk                                  /*!< DONETYPE[ 2:0] bits Done type selection. This field defines when the STAT_DONE status flag is asserted during the command operation.
 - 000: STAT_DONE flag is not asserted for this command.
 - 001: End of a command, before jumping to the next linked command. (default)
 - 011: End of an autorestart cycle, before starting the next cycle.
 - Others : Reserved.*/
#define DMA_CH_CTRL_DONETYPE_0                      (0x1UL << DMA_CH_CTRL_DONETYPE_Pos)                       /*!< 0x00200000UL*/
#define DMA_CH_CTRL_DONETYPE_1                      (0x2UL << DMA_CH_CTRL_DONETYPE_Pos)                       /*!< 0x00400000UL*/
#define DMA_CH_CTRL_DONETYPE_2                      (0x4UL << DMA_CH_CTRL_DONETYPE_Pos)                       /*!< 0x00800000UL*/
#define DMA_CH_CTRL_DONEPAUSEEN_Pos                 (24U)
#define DMA_CH_CTRL_DONEPAUSEEN_Msk                 (0x1UL << DMA_CH_CTRL_DONEPAUSEEN_Pos)                    /*!< 0x01000000UL*/
#define DMA_CH_CTRL_DONEPAUSEEN                     DMA_CH_CTRL_DONEPAUSEEN_Msk                               /*!< DONEPAUSEEN bit Done pause enable. When set to HIGH the assertion of the STAT_DONE flag results in an automatic pause request for the current DMA operation. When the paused state is reached the STAT_RESUMEWAIT flag is also set. When set to LOW the assertion of the STAT_DONE does not pause the progress of the command and the next operation of the channel will be started immediately after the STAT_DONE flag is set.*/
#define DMA_CH_CTRL_USESRCTRIGIN_Pos                (25U)
#define DMA_CH_CTRL_USESRCTRIGIN_Msk                (0x1UL << DMA_CH_CTRL_USESRCTRIGIN_Pos)                   /*!< 0x02000000UL*/
#define DMA_CH_CTRL_USESRCTRIGIN                    DMA_CH_CTRL_USESRCTRIGIN_Msk                              /*!< USESRCTRIGIN bit Enable Source Trigger Input use for this command.
 - 0: disable
 - 1: enable*/
#define DMA_CH_CTRL_USEDESTRIGIN_Pos                (26U)
#define DMA_CH_CTRL_USEDESTRIGIN_Msk                (0x1UL << DMA_CH_CTRL_USEDESTRIGIN_Pos)                   /*!< 0x04000000UL*/
#define DMA_CH_CTRL_USEDESTRIGIN                    DMA_CH_CTRL_USEDESTRIGIN_Msk                              /*!< USEDESTRIGIN bit Enable Destination Trigger Input use for this command.
 - 0: disable
 - 1: enable*/
#define DMA_CH_CTRL_USETRIGOUT_Pos                  (27U)
#define DMA_CH_CTRL_USETRIGOUT_Msk                  (0x1UL << DMA_CH_CTRL_USETRIGOUT_Pos)                     /*!< 0x08000000UL*/
#define DMA_CH_CTRL_USETRIGOUT                      DMA_CH_CTRL_USETRIGOUT_Msk                                /*!< USETRIGOUT bit Enable Trigger Output use for this command.
 - 0: disable
 - 1: enable*/
#define DMA_CH_CTRL_USEGPO_Pos                      (28U)
#define DMA_CH_CTRL_USEGPO_Msk                      (0x1UL << DMA_CH_CTRL_USEGPO_Pos)                         /*!< 0x10000000UL*/
#define DMA_CH_CTRL_USEGPO                          DMA_CH_CTRL_USEGPO_Msk                                    /*!< USEGPO bit Enable GPO use for this command.
 - 0: disable
 - 1: enable*/
#define DMA_CH_CTRL_USESTREAM_Pos                   (29U)
#define DMA_CH_CTRL_USESTREAM_Msk                   (0x1UL << DMA_CH_CTRL_USESTREAM_Pos)                      /*!< 0x20000000UL*/
#define DMA_CH_CTRL_USESTREAM                       DMA_CH_CTRL_USESTREAM_Msk                                 /*!< USESTREAM bit Enable Stream Interface use for this command.
 - 0: disable
 - 1: enable*/
/****************  Field definitions for CH_SRCADDR register  *****************/
#define DMA_CH_SRCADDR_SRCADDR_Pos                  (0U)
#define DMA_CH_SRCADDR_SRCADDR_Msk                  (0xFFFFFFFFUL << DMA_CH_SRCADDR_SRCADDR_Pos)              /*!< 0xFFFFFFFFUL*/
#define DMA_CH_SRCADDR_SRCADDR                      DMA_CH_SRCADDR_SRCADDR_Msk                                /*!< SRCADDR[31:0] bits Source Address [31:0].*/
/***************  Field definitions for CH_SRCADDRHI register  ****************/
#define DMA_CH_SRCADDRHI_SRCADDRHI_Pos              (0U)
#define DMA_CH_SRCADDRHI_SRCADDRHI_Msk              (0xFFFFFFFFUL << DMA_CH_SRCADDRHI_SRCADDRHI_Pos)          /*!< 0xFFFFFFFFUL*/
#define DMA_CH_SRCADDRHI_SRCADDRHI                  DMA_CH_SRCADDRHI_SRCADDRHI_Msk                            /*!< SRCADDRHI[31:0] bits Source Address [63:32]. Allows 64-bit addressing but the system might need less address bits defined by ADDR_WIDTH. The not implemented bits remain reserved.*/
/****************  Field definitions for CH_DESADDR register  *****************/
#define DMA_CH_DESADDR_DESADDR_Pos                  (0U)
#define DMA_CH_DESADDR_DESADDR_Msk                  (0xFFFFFFFFUL << DMA_CH_DESADDR_DESADDR_Pos)              /*!< 0xFFFFFFFFUL*/
#define DMA_CH_DESADDR_DESADDR                      DMA_CH_DESADDR_DESADDR_Msk                                /*!< DESADDR[31:0] bits Destination Address[31:0]*/
/***************  Field definitions for CH_DESADDRHI register  ****************/
#define DMA_CH_DESADDRHI_DESADDRHI_Pos              (0U)
#define DMA_CH_DESADDRHI_DESADDRHI_Msk              (0xFFFFFFFFUL << DMA_CH_DESADDRHI_DESADDRHI_Pos)          /*!< 0xFFFFFFFFUL*/
#define DMA_CH_DESADDRHI_DESADDRHI                  DMA_CH_DESADDRHI_DESADDRHI_Msk                            /*!< DESADDRHI[31:0] bits Destination Address[63:32]. Allows 64-bit addressing but the system might need less address bits defined by ADDR_WIDTH. The not implemented bits remain reserved.*/
/*****************  Field definitions for CH_XSIZE register  ******************/
#define DMA_CH_XSIZE_SRCXSIZE_Pos                   (0U)
#define DMA_CH_XSIZE_SRCXSIZE_Msk                   (0xFFFFUL << DMA_CH_XSIZE_SRCXSIZE_Pos)                   /*!< 0x0000FFFFUL*/
#define DMA_CH_XSIZE_SRCXSIZE                       DMA_CH_XSIZE_SRCXSIZE_Msk                                 /*!< SRCXSIZE[15:0] bits Source Number of Transfers in the X Dimension lower bits [15:0]. This register along with SRCXSIZEHI defines the source data block size of the DMA operation for any 1D operation, and defines the X dimension of the 2D source block for 2D operation.*/
#define DMA_CH_XSIZE_DESXSIZE_Pos                   (16U)
#define DMA_CH_XSIZE_DESXSIZE_Msk                   (0xFFFFUL << DMA_CH_XSIZE_DESXSIZE_Pos)                   /*!< 0xFFFF0000UL*/
#define DMA_CH_XSIZE_DESXSIZE                       DMA_CH_XSIZE_DESXSIZE_Msk                                 /*!< DESXSIZE[15:0] bits Destination Number of Transfers in the X Dimension lower bits [15:0]. This register along with DESXSIZEHI defines the destination data block size of the DMA operation for or any 1D operation, and defines the X dimension of the 2D destination block for a 2D operation. HAS_WRAP or HAS_STREAM configuration needs to be set to allow writes to this register, otherwise it is read-only and writing to SRCXSIZE will also update the value of this register.*/
/****************  Field definitions for CH_XSIZEHI register  *****************/
#define DMA_CH_XSIZEHI_SRCXSIZEHI_Pos               (0U)
#define DMA_CH_XSIZEHI_SRCXSIZEHI_Msk               (0xFFFFUL << DMA_CH_XSIZEHI_SRCXSIZEHI_Pos)               /*!< 0x0000FFFFUL*/
#define DMA_CH_XSIZEHI_SRCXSIZEHI                   DMA_CH_XSIZEHI_SRCXSIZEHI_Msk                             /*!< SRCXSIZEHI[15:0] bits Source Number of Transfers in the X Dimension high bits [31:16]. This register along with SRCXSIZE defines the source data block size of the DMA operation for any 1D operation, and defines the X dimension of the 2D source block for 2D operation.*/
#define DMA_CH_XSIZEHI_DESXSIZEHI_Pos               (16U)
#define DMA_CH_XSIZEHI_DESXSIZEHI_Msk               (0xFFFFUL << DMA_CH_XSIZEHI_DESXSIZEHI_Pos)               /*!< 0xFFFF0000UL*/
#define DMA_CH_XSIZEHI_DESXSIZEHI                   DMA_CH_XSIZEHI_DESXSIZEHI_Msk                             /*!< DESXSIZEHI[15:0] bits Destination Number of Transfers in the X Dimension high bits [31:16]. This register along with DESXSIZE defines the destination data block size of the DMA operation for or any 1D operation, and defines the X dimension of the 2D destination block for a 2D operation. HAS_WRAP or HAS_STREAM configuration needs to be set to allow writes to this register, otherwise it is read-only and writing to SRCXSIZEHI will also update the value of this register.*/
/**************  Field definitions for CH_SRCTRANSCFG register  ***************/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Pos         (0U)
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Msk         (0xFUL << DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Pos)            /*!< 0x0000000FUL*/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRLO             DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Msk                       /*!< SRCMEMATTRLO[ 3:0] bits Source Transfer Memory Attribute field [3:0].
When SRCMEMATTRHI is Device type (0000) then this field means:
 - 0000: Device-nGnRnE
 - 0100: Device-nGnRE
 - 1000: Device-nGRE
 - 1100: Device-GRE
 - Others: Invalid resulting in UNPREDICTABLE behavior
When SRCMEMATTRHI is Normal memory type (other than 0000) then this field means:
 - 0000: Reserved
 - 0001: Normal memory, Inner Write allocate, Inner Write-through transient
 - 0010: Normal memory, Inner Read allocate, Inner Write-through transient
 - 0011: Normal memory, Inner Read/Write allocate, Inner Write-through transient
 - 0100: Normal memory, Inner non-cacheable
 - 0101: Normal memory, Inner Write allocate, Inner Write-back transient
 - 0110: Normal memory, Inner Read allocate, Inner Write-back transient
 - 0111: Normal memory, Inner Read/Write allocate, Inner Write-back transient
 - 1000: Normal memory, Inner Write-through non-transient
 - 1001: Normal memory, Inner Write allocate, Inner Write-through non-transient
 - 1010: Normal memory, Inner Read allocate, Inner Write-through non-transient
 - 1011: Normal memory, Inner Read/Write allocate, Inner Write-through non-transient
 - 1100: Normal memory, Inner Write-back non-transient
 - 1101: Normal memory, Inner Write allocate, Inner Write-back non-transient
 - 1110: Normal memory, Inner Read allocate, Inner Write-back non-transient
 - 1111: Normal memory, Inner Read/Write allocate, Inner Write-back non-transient*/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_0           (0x1UL << DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Pos)            /*!< 0x00000001UL*/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_1           (0x2UL << DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Pos)            /*!< 0x00000002UL*/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_2           (0x4UL << DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Pos)            /*!< 0x00000004UL*/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_3           (0x8UL << DMA_CH_SRCTRANSCFG_SRCMEMATTRLO_Pos)            /*!< 0x00000008UL*/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRHI_Pos         (4U)
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRHI_Msk         (0xFUL << DMA_CH_SRCTRANSCFG_SRCMEMATTRHI_Pos)            /*!< 0x000000F0UL*/
#define DMA_CH_SRCTRANSCFG_SRCMEMATTRHI             DMA_CH_SRCTRANSCFG_SRCMEMATTRHI_Msk                       /*!< SRCMEMATTRHI[ 3:0] bits Source Transfer Memory Attribute field [7:4].
 - 0000: Device memory
 - 0001: Normal memory, Outer Write allocate, Outer Write-through transient
 - 0010: Normal memory, Outer Read allocate, Outer Write-through transient
 - 0011: Normal memory, Outer Read/Write allocate, Outer Write-through transient
 - 0100: Normal memory, Outer non-cacheable
 - 0101: Normal memory, Outer Write allocate, Outer Write-back transient
 - 0110: Normal memory, Outer Read allocate, Outer Write-back transient
 - 0111: Normal memory, Outer Read/Write allocate, Outer Write-back transient
 - 1000: Normal memory, Outer Write-through non-transient
