wosayttn/M55M1BSP/_CUnit/gdma/DMA350/dma350_regdef.h
#define DMA_CH_ERRINFO_SRCTRIGINSELERR              DMA_CH_ERRINFO_SRCTRIGINSELERR_Msk                        /*!< SRCTRIGINSELERR bit Source Trigger Input Selection Error Flag. Set when the command selects a source trigger input that is not allowed for this channel.*/
#define DMA_CH_ERRINFO_DESTRIGINSELERR_Pos          (3U)
#define DMA_CH_ERRINFO_DESTRIGINSELERR_Msk          (0x1UL << DMA_CH_ERRINFO_DESTRIGINSELERR_Pos)             /*!< 0x00000008UL*/
#define DMA_CH_ERRINFO_DESTRIGINSELERR              DMA_CH_ERRINFO_DESTRIGINSELERR_Msk                        /*!< DESTRIGINSELERR bit Destination Trigger Input Selection Error Flag. Set when the command selects a destination trigger input that is not allowed for this channel.*/
#define DMA_CH_ERRINFO_TRIGOUTSELERR_Pos            (4U)
#define DMA_CH_ERRINFO_TRIGOUTSELERR_Msk            (0x1UL << DMA_CH_ERRINFO_TRIGOUTSELERR_Pos)               /*!< 0x00000010UL*/
#define DMA_CH_ERRINFO_TRIGOUTSELERR                DMA_CH_ERRINFO_TRIGOUTSELERR_Msk                          /*!< TRIGOUTSELERR bit Trigger Output Selection Error Flag. Set when the command selects a trigger output that is not allowed for this channel.*/
#define DMA_CH_ERRINFO_STREAMERR_Pos                (7U)
#define DMA_CH_ERRINFO_STREAMERR_Msk                (0x1UL << DMA_CH_ERRINFO_STREAMERR_Pos)                   /*!< 0x00000080UL*/
#define DMA_CH_ERRINFO_STREAMERR                    DMA_CH_ERRINFO_STREAMERR_Msk                              /*!< STREAMERR bit Stream Interface Error Flag. Set when the stream interface encountered an error.*/
#define DMA_CH_ERRINFO_ERRINFO_Pos                  (16U)
#define DMA_CH_ERRINFO_ERRINFO_Msk                  (0xFFFFUL << DMA_CH_ERRINFO_ERRINFO_Pos)                  /*!< 0xFFFF0000UL*/
#define DMA_CH_ERRINFO_ERRINFO                      DMA_CH_ERRINFO_ERRINFO_Msk                                /*!< ERRINFO[15:0] bits Error information Register. Additional information for the error that is encountered by the DMA. The meaning of the bits are detailed in the Error Handling section.*/
/******************  Field definitions for CH_IIDR register  ******************/
#define DMA_CH_IIDR_IMPLEMENTER_Pos                 (0U)
#define DMA_CH_IIDR_IMPLEMENTER_Msk                 (0xFFFUL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000FFFUL*/
#define DMA_CH_IIDR_IMPLEMENTER                     DMA_CH_IIDR_IMPLEMENTER_Msk                               /*!< IMPLEMENTER[11:0] bits Contains the JEP106 code of the company that implemented the IP:
 - [11:8]: JEP106 continuation code of implementer.
 - [7]: Always 0.
 - [6:0]: JEP106 identity code of implementer.
For Arm this field reads as 0x43B.*/
#define DMA_CH_IIDR_IMPLEMENTER_0                   (0x1UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000001UL*/
#define DMA_CH_IIDR_IMPLEMENTER_1                   (0x2UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000002UL*/
#define DMA_CH_IIDR_IMPLEMENTER_2                   (0x4UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000004UL*/
#define DMA_CH_IIDR_IMPLEMENTER_3                   (0x8UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000008UL*/
#define DMA_CH_IIDR_IMPLEMENTER_4                   (0x10UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000010UL*/
#define DMA_CH_IIDR_IMPLEMENTER_5                   (0x20UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000020UL*/
#define DMA_CH_IIDR_IMPLEMENTER_6                   (0x40UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000040UL*/
#define DMA_CH_IIDR_IMPLEMENTER_7                   (0x80UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000080UL*/
#define DMA_CH_IIDR_IMPLEMENTER_8                   (0x100UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000100UL*/
#define DMA_CH_IIDR_IMPLEMENTER_9                   (0x200UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000200UL*/
#define DMA_CH_IIDR_IMPLEMENTER_10                  (0x400UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000400UL*/
#define DMA_CH_IIDR_IMPLEMENTER_11                  (0x800UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000800UL*/
#define DMA_CH_IIDR_REVISION_Pos                    (12U)
#define DMA_CH_IIDR_REVISION_Msk                    (0xFUL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x0000F000UL*/
#define DMA_CH_IIDR_REVISION                        DMA_CH_IIDR_REVISION_Msk                                  /*!< REVISION[ 3:0] bits Indicates the minor revision of the product rxpy identifier*/
#define DMA_CH_IIDR_REVISION_0                      (0x1UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00001000UL*/
#define DMA_CH_IIDR_REVISION_1                      (0x2UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00002000UL*/
#define DMA_CH_IIDR_REVISION_2                      (0x4UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00004000UL*/
#define DMA_CH_IIDR_REVISION_3                      (0x8UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00008000UL*/
#define DMA_CH_IIDR_VARIANT_Pos                     (16U)
#define DMA_CH_IIDR_VARIANT_Msk                     (0xFUL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x000F0000UL*/
#define DMA_CH_IIDR_VARIANT                         DMA_CH_IIDR_VARIANT_Msk                                   /*!< VARIANT[ 3:0] bits Indicates the major revision, or variant, of the product rxpy identifier*/
#define DMA_CH_IIDR_VARIANT_0                       (0x1UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00010000UL*/
#define DMA_CH_IIDR_VARIANT_1                       (0x2UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00020000UL*/
#define DMA_CH_IIDR_VARIANT_2                       (0x4UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00040000UL*/
#define DMA_CH_IIDR_VARIANT_3                       (0x8UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00080000UL*/
#define DMA_CH_IIDR_PRODUCTID_Pos                   (20U)
#define DMA_CH_IIDR_PRODUCTID_Msk                   (0xFFFUL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0xFFF00000UL*/
#define DMA_CH_IIDR_PRODUCTID                       DMA_CH_IIDR_PRODUCTID_Msk                                 /*!< PRODUCTID[11:0] bits Indicates the product ID*/
#define DMA_CH_IIDR_PRODUCTID_0                     (0x1UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00100000UL*/
#define DMA_CH_IIDR_PRODUCTID_1                     (0x2UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00200000UL*/
#define DMA_CH_IIDR_PRODUCTID_2                     (0x4UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00400000UL*/
#define DMA_CH_IIDR_PRODUCTID_3                     (0x8UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00800000UL*/
#define DMA_CH_IIDR_PRODUCTID_4                     (0x10UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x01000000UL*/
#define DMA_CH_IIDR_PRODUCTID_5                     (0x20UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x02000000UL*/
#define DMA_CH_IIDR_PRODUCTID_6                     (0x40UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x04000000UL*/
#define DMA_CH_IIDR_PRODUCTID_7                     (0x80UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x08000000UL*/
#define DMA_CH_IIDR_PRODUCTID_8                     (0x100UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x10000000UL*/
#define DMA_CH_IIDR_PRODUCTID_9                     (0x200UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x20000000UL*/
#define DMA_CH_IIDR_PRODUCTID_10                    (0x400UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x40000000UL*/
#define DMA_CH_IIDR_PRODUCTID_11                    (0x800UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x80000000UL*/
/******************  Field definitions for CH_AIDR register  ******************/
#define DMA_CH_AIDR_ARCH_MINOR_REV_Pos              (0U)
#define DMA_CH_AIDR_ARCH_MINOR_REV_Msk              (0xFUL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x0000000FUL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV                  DMA_CH_AIDR_ARCH_MINOR_REV_Msk                            /*!< ARCH_MINOR_REV[ 3:0] bits Architecture Minor Revision.*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_0                (0x1UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000001UL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_1                (0x2UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000002UL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_2                (0x4UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000004UL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_3                (0x8UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000008UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_Pos              (4U)
#define DMA_CH_AIDR_ARCH_MAJOR_REV_Msk              (0xFUL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x000000F0UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV                  DMA_CH_AIDR_ARCH_MAJOR_REV_Msk                            /*!< ARCH_MAJOR_REV[ 3:0] bits Architecture Major Revision.*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_0                (0x1UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000010UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_1                (0x2UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000020UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_2                (0x4UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000040UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_3                (0x8UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000080UL*/
/****************  Field definitions for CH_ISSUECAP register  ****************/
#define DMA_CH_ISSUECAP_ISSUECAP_Pos                (0U)
#define DMA_CH_ISSUECAP_ISSUECAP_Msk                (0x7UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000007UL*/
#define DMA_CH_ISSUECAP_ISSUECAP                    DMA_CH_ISSUECAP_ISSUECAP_Msk                              /*!< ISSUECAP[ 2:0] bits ISSUECAP can be used by software to place a constraint on allowed issuing capability in both read and write direction.*/
#define DMA_CH_ISSUECAP_ISSUECAP_0                  (0x1UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000001UL*/
#define DMA_CH_ISSUECAP_ISSUECAP_1                  (0x2UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000002UL*/
#define DMA_CH_ISSUECAP_ISSUECAP_2                  (0x4UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000004UL*/
/***************  Field definitions for CH_BUILDCFG0 register  ****************/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos         (0U)
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Msk         (0xFFUL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x000000FFUL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE             DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Msk                       /*!< DATA_BUFF_SIZE[ 7:0] bits Data Buffer Size in entries - 1. Total Size = ((DATA_BUFF_SIZE + 1) * DATA_WIDTH /8) bytes.*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_0           (0x1UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000001UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_1           (0x2UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000002UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_2           (0x4UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000004UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_3           (0x8UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000008UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_4           (0x10UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000010UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_5           (0x20UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000020UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_6           (0x40UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000040UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_7           (0x80UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000080UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos          (8U)
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Msk          (0xFFUL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x0000FF00UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE              DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Msk                        /*!< CMD_BUFF_SIZE[ 7:0] bits Command Buffer Size in command words - 1. Total Size = (CMD_BUFF_SIZE + 1) * 4 bytes.*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_0            (0x1UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000100UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_1            (0x2UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000200UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_2            (0x4UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000400UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_3            (0x8UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000800UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_4            (0x10UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00001000UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_5            (0x20UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00002000UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_6            (0x40UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00004000UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_7            (0x80UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00008000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos             (16U)
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_Msk             (0x3FUL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x003F0000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH                 DMA_CH_BUILDCFG0_ADDR_WIDTH_Msk                           /*!< ADDR_WIDTH[ 5:0] bits Address Width in bits = ADDR_WIDTH + 1*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_0               (0x1UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00010000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_1               (0x2UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00020000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_2               (0x4UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00040000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_3               (0x8UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00080000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_4               (0x10UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00100000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_5               (0x20UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00200000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_Pos             (22U)
#define DMA_CH_BUILDCFG0_DATA_WIDTH_Msk             (0x7UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x01C00000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH                 DMA_CH_BUILDCFG0_DATA_WIDTH_Msk                           /*!< DATA_WIDTH[ 2:0] bits Data Width.
 - 000: 8-bit
 - 001: 16-bit
 - 010: 32-bit
 - 011: 64-bit
 - 100: 128-bit
 - 101: 256-bit
 - 110: 512-bit
 - 111: 1024-bit*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_0               (0x1UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x00400000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_1               (0x2UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x00800000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_2               (0x4UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x01000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_Pos              (26U)
#define DMA_CH_BUILDCFG0_INC_WIDTH_Msk              (0xFUL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x3C000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH                  DMA_CH_BUILDCFG0_INC_WIDTH_Msk                            /*!< INC_WIDTH[ 3:0] bits Width of the increment register = INC_WIDTH + 1.
When set to 0, then only 0 and 1 can be set as an increment. When larger values are used, then negative increments can be set using 2's complement:
INC_WIDTH = 0: 0..1
INC_WIDTH = 1: -2..1
INC_WIDTH = 2: -4..3
INC_WIDTH = 3: -8..7
…
INC_WIDTH = 15: -32768..32767*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_0                (0x1UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x04000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_1                (0x2UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x08000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_2                (0x4UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x10000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_3                (0x8UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x20000000UL*/
/***************  Field definitions for CH_BUILDCFG1 register  ****************/
#define DMA_CH_BUILDCFG1_HAS_XSIZEHI_Pos            (0U)
#define DMA_CH_BUILDCFG1_HAS_XSIZEHI_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_XSIZEHI_Pos)               /*!< 0x00000001UL*/
#define DMA_CH_BUILDCFG1_HAS_XSIZEHI                DMA_CH_BUILDCFG1_HAS_XSIZEHI_Msk                          /*!< HAS_XSIZEHI bit Has 32-bit XSIZE counters.*/
#define DMA_CH_BUILDCFG1_HAS_WRAP_Pos               (1U)
#define DMA_CH_BUILDCFG1_HAS_WRAP_Msk               (0x1UL << DMA_CH_BUILDCFG1_HAS_WRAP_Pos)                  /*!< 0x00000002UL*/
#define DMA_CH_BUILDCFG1_HAS_WRAP                   DMA_CH_BUILDCFG1_HAS_WRAP_Msk                             /*!< HAS_WRAP bit Has wrap capability.*/
#define DMA_CH_BUILDCFG1_HAS_2D_Pos                 (2U)
#define DMA_CH_BUILDCFG1_HAS_2D_Msk                 (0x1UL << DMA_CH_BUILDCFG1_HAS_2D_Pos)                    /*!< 0x00000004UL*/
#define DMA_CH_BUILDCFG1_HAS_2D                     DMA_CH_BUILDCFG1_HAS_2D_Msk                               /*!< HAS_2D bit Has 2D capability.*/
#define DMA_CH_BUILDCFG1_HAS_TMPLT_Pos              (3U)
#define DMA_CH_BUILDCFG1_HAS_TMPLT_Msk              (0x1UL << DMA_CH_BUILDCFG1_HAS_TMPLT_Pos)                 /*!< 0x00000008UL*/
#define DMA_CH_BUILDCFG1_HAS_TMPLT                  DMA_CH_BUILDCFG1_HAS_TMPLT_Msk                            /*!< HAS_TMPLT bit Has template based pack and unpack capability.*/
#define DMA_CH_BUILDCFG1_HAS_TRIG_Pos               (4U)
#define DMA_CH_BUILDCFG1_HAS_TRIG_Msk               (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIG_Pos)                  /*!< 0x00000010UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIG                   DMA_CH_BUILDCFG1_HAS_TRIG_Msk                             /*!< HAS_TRIG bit Has trigger capability.*/
#define DMA_CH_BUILDCFG1_HAS_TRIGIN_Pos             (5U)
#define DMA_CH_BUILDCFG1_HAS_TRIGIN_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIGIN_Pos)                /*!< 0x00000020UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIGIN                 DMA_CH_BUILDCFG1_HAS_TRIGIN_Msk                           /*!< HAS_TRIGIN bit Has hardware trigger input ports.*/
#define DMA_CH_BUILDCFG1_HAS_TRIGOUT_Pos            (6U)
#define DMA_CH_BUILDCFG1_HAS_TRIGOUT_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIGOUT_Pos)               /*!< 0x00000040UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIGOUT                DMA_CH_BUILDCFG1_HAS_TRIGOUT_Msk                          /*!< HAS_TRIGOUT bit Has hardware trigger output port.*/
#define DMA_CH_BUILDCFG1_HAS_TRIGSEL_Pos            (7U)
#define DMA_CH_BUILDCFG1_HAS_TRIGSEL_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIGSEL_Pos)               /*!< 0x00000080UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIGSEL                DMA_CH_BUILDCFG1_HAS_TRIGSEL_Msk                          /*!< HAS_TRIGSEL bit Has selectable triggers.*/
#define DMA_CH_BUILDCFG1_HAS_CMDLINK_Pos            (8U)
#define DMA_CH_BUILDCFG1_HAS_CMDLINK_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_CMDLINK_Pos)               /*!< 0x00000100UL*/
#define DMA_CH_BUILDCFG1_HAS_CMDLINK                DMA_CH_BUILDCFG1_HAS_CMDLINK_Msk                          /*!< HAS_CMDLINK bit Has command link list capability.*/
#define DMA_CH_BUILDCFG1_HAS_AUTO_Pos               (9U)
#define DMA_CH_BUILDCFG1_HAS_AUTO_Msk               (0x1UL << DMA_CH_BUILDCFG1_HAS_AUTO_Pos)                  /*!< 0x00000200UL*/
#define DMA_CH_BUILDCFG1_HAS_AUTO                   DMA_CH_BUILDCFG1_HAS_AUTO_Msk                             /*!< HAS_AUTO bit Has automatic reload and restart capability.*/
#define DMA_CH_BUILDCFG1_HAS_WRKREG_Pos             (10U)
#define DMA_CH_BUILDCFG1_HAS_WRKREG_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_WRKREG_Pos)                /*!< 0x00000400UL*/
#define DMA_CH_BUILDCFG1_HAS_WRKREG                 DMA_CH_BUILDCFG1_HAS_WRKREG_Msk                           /*!< HAS_WRKREG bit Has internal register view capability.*/
#define DMA_CH_BUILDCFG1_HAS_STREAM_Pos             (11U)
#define DMA_CH_BUILDCFG1_HAS_STREAM_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_STREAM_Pos)                /*!< 0x00000800UL*/
#define DMA_CH_BUILDCFG1_HAS_STREAM                 DMA_CH_BUILDCFG1_HAS_STREAM_Msk                           /*!< HAS_STREAM bit Has stream interface support.*/
#define DMA_CH_BUILDCFG1_HAS_STREAMSEL_Pos          (12U)
#define DMA_CH_BUILDCFG1_HAS_STREAMSEL_Msk          (0x1UL << DMA_CH_BUILDCFG1_HAS_STREAMSEL_Pos)             /*!< 0x00001000UL*/
#define DMA_CH_BUILDCFG1_HAS_STREAMSEL              DMA_CH_BUILDCFG1_HAS_STREAMSEL_Msk                        /*!< HAS_STREAMSEL bit Has selectable stream interfaces.*/
#define DMA_CH_BUILDCFG1_HAS_GPOSEL_Pos             (18U)
#define DMA_CH_BUILDCFG1_HAS_GPOSEL_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_GPOSEL_Pos)                /*!< 0x00040000UL*/
#define DMA_CH_BUILDCFG1_HAS_GPOSEL                 DMA_CH_BUILDCFG1_HAS_GPOSEL_Msk                           /*!< HAS_GPOSEL bit Has shared GPO ports between channels.*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_Pos              (19U)
#define DMA_CH_BUILDCFG1_GPO_WIDTH_Msk              (0x7FUL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x03F80000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH                  DMA_CH_BUILDCFG1_GPO_WIDTH_Msk                            /*!< GPO_WIDTH[ 6:0] bits General Purpose Output Width. 0 to 64.*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_0                (0x1UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00080000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_1                (0x2UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00100000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_2                (0x4UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00200000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_3                (0x8UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00400000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_4                (0x10UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x00800000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_5                (0x20UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x01000000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_6                (0x40UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x02000000UL*/
/******************************************************************************/
/*                                DMANSECCTRL                                 */
/******************************************************************************/
/************  Field definitions for NSEC_CHINTRSTATUS0 register  *************/
#define DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Pos    (0U)
#define DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Msk    (0xFFFFFFFFUL << DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Pos)/*!< 0xFFFFFFFFUL*/
#define DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0        DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Msk                  /*!< CHINTRSTATUS0[31:0] bits Collated Non-Secure Channel Interrupt flags for channel 0 to channel 31. Limited by NUM_CHANNELS, all unimplemented bits are reserved.*/
